# Taps
tap "1password/tap"
tap "buo/cask-upgrade"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "moritzsternemann/apple-fonts"
tap "oven-sh/bun"
tap "rigellute/tap"
tap "thezoraiz/ascii-image-converter"

# Packages
brew "thezoraiz/ascii-image-converter/ascii-image-converter" # Convert images into ascii art
brew "atuin" # Improved shell history for zsh, bash, fish and nushell
brew "bash" # Bourne-Again SHell, a UNIX command interpreter
brew "bat" # Clone of cat(1) with syntax highlighting and Git integration
brew "bat-extras" # Bash scripts that integrate bat with various command-line tools
brew "binutils" # GNU binary tools for native development
brew "oven-sh/bun/bun" # Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "coreutils" # GNU File, Shell, and Text utilities
brew "curl" # Get a file from an HTTP, HTTPS or FTP server
brew "eza" # Modern, maintained replacement for ls
brew "fd" # Simple, fast and user-friendly alternative to find
brew "figlet" # Banner-like program prints strings as ASCII art
brew "findutils" # Collection of GNU find, xargs, and locate
brew "flyctl" # Command-line tools for fly.io services
brew "fortune" # Infamous electronic fortune-cookie generator
brew "fzf" # Command-line fuzzy finder written in Go
brew "gawk" # GNU awk utility
brew "gcc" # GNU compiler collection
brew "gdu" # Disk usage analyzer with console interface written in Go
brew "gh" # GitHub command-line tool
brew "git-crypt" # Enable transparent encryption/decryption of files in a git repo
brew "git-delta" # Syntax-highlighting pager for git and diff output
brew "git-lfs" # Git extension for versioning large files
brew "gitui" # Blazing fast terminal-ui for git written in rust
brew "glances" # Alternative to top/htop
brew "glib" # Core application library for C
brew "gnu-sed" # GNU implementation of the famous stream editor
brew "gnu-tar" # GNU version of the tar archiving utility
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
brew "gnutls" # GNU Transport Layer Security (TLS) Library
brew "go" # Open source programming language to build simple/reliable/efficient software
brew "grc" # Colorize logfiles and command output
brew "guile" # GNU Ubiquitous Intelligent Language for Extensions
brew "harfbuzz" # OpenType text shaping engine
brew "htop" # Improved top (interactive process viewer)
brew "hub" # Add GitHub support to git on the command-line
brew "huggingface-cli" # Client library for huggingface.co hub
brew "irssi" # Modular IRC client
brew "jq" # Lightweight and flexible command-line JSON processor
brew "koekeishiya/formulae/krp" # Utility to adjust keyrepeat settings for MacOS.
brew "libyaml" # YAML Parser
brew "lolcat" # Rainbows and unicorns in your console!
brew "lua-language-server" # Language Server for the Lua language
brew "luajit" # Just-In-Time Compiler (JIT) for the Lua programming langua
brew "luarocks" # Package manager for the Lua programming language
brew "macchina" # System information fetcher, with an emphasis on performance and minimalism
brew "macpine" # Lightweight Linux VMs on MacOS
brew "make" # Utility for directing compilation
brew "mas" # Mac App Store command-line interface
brew "mongosh" # MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "moreutils" # Collection of tools that nobody wrote when UNIX was young
brew "neovim" # Ambitious Vim-fork focused on extensibility and agility
brew "openjdk@11" # Development kit for the Java programming language
brew "osx-cpu-temp" # Outputs current CPU temperature for OSX
brew "perl" # Highly capable, feature-rich programming language
brew "pnpm" # Fast, disk space efficient package manager
brew "prettier" # Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettyping" # Wrapper to colorize and simplify ping's output
brew "protobuf" # Protocol buffers (Google's data interchange format)
brew "pstree" # Show ps output as a tree
brew "pyenv" # Python version management
brew "pyenv-virtualenv" # Pyenv plugin to manage virtualenv
brew "ranger" # File browser
brew "readline" # Library for command-line editing
brew "rg" # Search tool like grep and The Silver Searcher
brew "rich-cli" # Command-line toolbox for fancy output in the terminal
brew "shellcheck" # Static analysis and lint tool, for (ba)sh scripts
brew "shfmt" # Autoformat shell script source code
brew "koekeishiya/formulae/skhd" # Simple hotkey-daemon for macOS.
brew "rigellute/tap/spotify-tui" # A terminal user interface for Spotify
brew "sqlite" # Command-line interface for SQLite
brew "stylua" # Opinionated Lua code formatter
brew "telnet" # User interface to the TELNET protocol
brew "tldr" # Simplified and community-driven man pages
brew "tmux" # Terminal multiplexer
brew "trash-cli" # Command-line interface to the freedesktop.org trashcan
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "tty-clock" # Digital clock in ncurses
brew "vim" # Vi 'workalike' with many additional features
brew "watch" # Executes a program periodically, showing output fullscreen
brew "weechat" # Extensible IRC client
brew "wget" # Internet file retriever
brew "xclip" # Access X11 clipboards from the command-line
brew "xsel" # Command-line program for getting and setting the contents of the X selection
brew "koekeishiya/formulae/yabai" # A tiling window manager for macOS based on binary space partitioning.
brew "yamllint" # Linter for YAML files
brew "yarn" # JavaScript package manager
brew "yazi" # Blazing fast terminal file manager written in Rust, based on async I/O
brew "yt-dlp" # Feature-rich command-line audio/video downloader

# Casks
cask "1password-cli" # (1Password CLI) Command-line interface for 1Password
cask "adium" # (Adium) Instant messaging application
cask "apparency" # (Apparency) Inspect application bundles
cask "betterdisplay" # (BetterDisplay) Display management tool
cask "brave-browser" # (Brave) Web browser focusing on privacy
cask "docker" # Pack, ship and run any application as a lightweight container
cask "firefox" # (Mozilla Firefox) Web browser
cask "font-cascadia-code-pl" # (Cascadia Code PL) [no description]
cask "font-cascadia-mono-pl" # (Cascadia Mono PL) [no description]
cask "font-caskaydia-cove-nerd-font" # (CaskaydiaCove Nerd Font (Cascadia Code)) [no description]
cask "font-caskaydia-mono-nerd-font" # (CaskaydiaMono Nerd Font (Cascadia Mono)) [no description]
cask "font-fira-code-nerd-font" # (FiraCode Nerd Font (Fira Code)) [no description]
cask "font-fira-mono-nerd-font" # (FiraMono Nerd Font (Fira)) [no description]
cask "iina" # (IINA) Free and open-source media player
cask "karabiner-elements" # (Karabiner Elements) Keyboard customiser
cask "kitty" # GPU-based terminal emulator
cask "macs-fan-control" # (Macs Fan Control) Controls and monitors all fans on Apple computers
cask "marta" # (Marta File Manager) Extensible two-pane file manager
cask "megasync" # (MEGAsync) Syncs files between computers and MEGA Cloud drives
cask "nvidia-geforce-now" # (NVIDIA GeForce NOW) Cloud gaming platform
cask "openinterminal" # (OpenInTerminal) Finder Toolbar app to open the current directory in Terminal or Editor
cask "postman" # (Postman) Collaboration platform for API development
cask "spotify" # (Spotify) Music streaming service
cask "steam" # (Steam) Video game digital distribution service
cask "suspicious-package" # (Suspicious Package) Application for inspecting installer packages
cask "transmission" # Lightweight BitTorrent client
cask "vlc" # (VLC media player) Multimedia player
cask "vscodium" # (VSCodium) Binary releases of VS Code without MS branding/telemetry/licensing
cask "wezterm" # (WezTerm) GPU-accelerated cross-platform terminal emulator and multiplexer

# App Store
mas "1Password for Safari", id: 1569813296
mas "Actions", id: 1586435171
mas "Color Picker", id: 1545870783
mas "MEGA VPN", id: 6456784858
mas "Peek", id: 1554235898
mas "Taify", id: 6502970995
mas "TestFlight", id: 899247664
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835