cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'autoenv'
brew 'coreutils'
brew 'fnm'
brew 'go'
brew 'gh'
brew 'mongocli'
brew 'node'
brew 'ranger'
brew 'shellcheck'
brew 'shfmt'
brew 'wget'
brew 'yarn'
brew 'yt-dlp/taps/yt-dlp'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

cask 'apparency'
cask 'appcleaner'
cask 'battle-net'
cask 'brave-browser'
cask 'iterm2'
cask 'mongodb-compass'
cask 'obs'
cask 'postman'
cask 'sketch'
cask 'spotify'
cask 'suspicious-package'
cask 'steam'
cask 'tor-browser'
cask 'transmission'
cask 'vlc'
cask 'visual-studio-code'

cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
