tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "shivammathur/php"
tap "yt-dlp/taps"
brew "ack"
brew "bat"
brew "bc"
brew "openssl@3"
brew "code-cli"
brew "coreutils"
brew "exa"
brew "fd"
brew "findutils"
brew "flyctl"
brew "fzf"
brew "gh"
brew "go"
brew "httpd"
brew "hydra"
brew "lua"
brew "mas"
brew "mongocli"
brew "mongodb-atlas-cli"
brew "moreutils"
brew "neofetch"
brew "openjdk"
brew "pipenv"
brew "pyenv"
brew "ranger"
brew "rhash"
brew "ripgrep"
brew "shellcheck"
brew "tree"
brew "vim"
brew "wget"
brew "z"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "heroku/brew/heroku"
brew "shivammathur/php/php"
brew "shivammathur/php/php@8.0"
brew "yt-dlp/taps/yt-dlp"
cask "apparency"
cask "cheatsheet"
cask "google-chrome"
cask "open-in-code"
cask "suspicious-package"
cask "wireshark"
mas "Peek", id: 1554235898
mas "Pipper", id: 1587335166
mas "Xcode", id: 497799835
