tap "bramstein/webfonttools"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "yt-dlp/taps"
brew "ack"
brew "autoenv"
brew "bat"
brew "bc"
brew "ca-certificates"
brew "catimg"
brew "coreutils"
brew "exa"
brew "fd"
brew "findutils"
brew "fnm"
brew "readline"
brew "sqlite"
brew "xz"
brew "folderify"
brew "fzf"
brew "gh"
brew "git"
brew "git-extras"
brew "go"
brew "lua"
brew "luarocks"
brew "mas"
brew "mongocli"
brew "moreutils"
brew "neofetch"
brew "nmap"
brew "openssl@3"
brew "pipenv"
brew "pipx"
brew "pyenv"
brew "ranger"
brew "ripgrep"
brew "shellcheck"
brew "tldr"
brew "tree"
brew "wget"
brew "yarn"
brew "z"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "heroku/brew/heroku"
brew "yt-dlp/taps/yt-dlp"
cask "google-chrome"
cask "hammerspoon"
mas "Hidden Bar", id: 1452453066
mas "Speedtest", id: 1153157709
mas "The Unarchiver", id: 425424353
mas "Userscripts", id: 1463298887
mas "Xcode", id: 497799835
