tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "yt-dlp/taps"
brew "ack"
brew "bat"
brew "bc"
brew "coreutils"
brew "exa"
brew "fd"
brew "findutils"
brew "fnm"
brew "fzf"
brew "gh"
brew "go"
brew "lua"
brew "luarocks"
brew "mas"
brew "mongocli"
brew "moreutils"
brew "neofetch"
brew "pipenv"
brew "pyenv"
brew "ranger"
brew "ripgrep"
brew "shellcheck"
brew "tree"
brew "yarn"
brew "z"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "heroku/brew/heroku"
cask "apparency"
cask "cheatsheet"
cask "qlmarkdown"
cask "suspicious-package"
cask "syntax-highlight"
mas "Hidden Bar", id: 1452453066
mas "LimeChat", id: 414030210
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
