tap "buo/cask-upgrade"
tap "chase/tap"
tap "felixkratz/formulae"
tap "iina/mpv-iina"
tap "koekeishiya/formulae"
tap "oven-sh/bun"
tap "rigellute/tap"
brew "readline"
brew "sqlite"
brew "awscli"
brew "bash"
brew "bat"
brew "bat-extras"
brew "binutils"
brew "btop"
brew "glib"
brew "ccls"
brew "cmake"
brew "coreutils"
brew "curl"
brew "duckdb"
brew "elixir"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "fd"
brew "gnutls"
brew "harfbuzz"
brew "ffmpeg"
brew "figlet"
brew "findutils"
brew "flyctl"
brew "fortune"
brew "fzf"
brew "gallery-dl"
brew "gawk"
brew "gcc"
brew "gdu"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "git-lfs"
brew "gitui"
brew "glow"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "grc"
brew "pkgconf"
brew "guile"
brew "htop"
brew "libyaml"
brew "huggingface-cli"
brew "imagemagick"
brew "irssi"
brew "jq"
brew "keychain"
brew "lazydocker"
brew "lazygit"
brew "lolcat"
brew "lua"
brew "lua-language-server"
brew "luajit"
brew "luarocks"
brew "macchina"
brew "macpine"
brew "make"
brew "mas"
brew "media-info"
brew "mkcert"
brew "mongosh"
brew "mono"
brew "moreutils"
brew "mtr"
brew "nasm"
brew "nmap"
brew "numpy"
brew "nvm"
brew "ollama", restart_service: :changed
brew "opam"
brew "openjdk"
brew "openjdk@11"
brew "openjdk@17"
brew "osx-cpu-temp"
brew "p7zip"
brew "perl"
brew "php"
brew "poppler"
brew "prettier"
brew "prettyping"
brew "protobuf"
brew "pstree"
brew "python@3.10"
brew "ranger"
brew "resvg"
brew "rich-cli"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "sshpass"
brew "staticcheck"
brew "stylua"
brew "telnet"
brew "tlrc"
brew "tmux"
brew "transmission-cli"
brew "tree"
brew "tty-clock"
brew "typescript"
brew "unar"
brew "vim"
brew "watch"
brew "weechat"
brew "wget"
brew "xclip"
brew "xsel"
brew "yamllint"
brew "yazi"
brew "yt-dlp"
brew "zig"
brew "zoxide"
brew "chase/tap/awrit"
brew "koekeishiya/formulae/krp"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "oven-sh/bun/bun"
brew "rigellute/tap/spotify-tui"
cask "1password"
cask "1password-cli"
cask "anaconda"
cask "apparency"
cask "betterdisplay"
cask "blender"
cask "brave-browser"
cask "chatgpt"
cask "comfyui"
cask "diffusionbee"
cask "discord"
cask "docker"
cask "dotnet-sdk"
cask "firefox"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono-pl"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "gimp"
cask "google-chrome"
cask "gpg-suite"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "keka"
cask "lm-studio"
cask "macs-fan-control"
cask "megasync"
cask "miniforge"
cask "nvidia-geforce-now"
cask "openinterminal"
cask "postman"
cask "qutebrowser"
cask "spotify"
cask "steam"
cask "stolendata-mpv"
cask "suspicious-package"
cask "tor-browser"
cask "transmission"
cask "unity-hub"
cask "visual-studio-code"
cask "vlc"
cask "vscodium"
mas "1Password for Safari", id: 1569813296
mas "Color Picker", id: 1545870783
mas "MEGAVPN", id: 6456784858
mas "Peek", id: 1554235898
mas "Tampermonkey", id: 6738342400
mas "Unread", id: 1363637349
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "be5invis.vscode-custom-css"
vscode "christian-kohler.npm-intellisense"
vscode "cloudedcat.vscode-model-viewer"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dotenv.dotenv-vscode"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "golang.go"
vscode "hoovercj.vscode-settings-cycler"
vscode "johnnymorganz.stylua"
vscode "matt-rudge.auto-open-preview-panel"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "naumovs.color-highlight"
vscode "neonxp.gotools"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vue.volar"
vscode "zhuangtongfa.material-theme"
vscode "ziglang.vscode-zig"
