tap "1password/tap"
tap "aws/tap"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "moritzsternemann/apple-fonts"
tap "oven-sh/bun"
tap "rigellute/tap"
tap "stripe/stripe-cli"
tap "thezoraiz/ascii-image-converter"
tap "zirixcz/vesktop"
brew "python@3.12"
brew "asciinema"
brew "atuin"
brew "awscli"
brew "awscurl"
brew "bash"
brew "bat"
brew "bat-extras"
brew "binutils"
brew "bottom"
brew "gettext"
brew "glib"
brew "ccls"
brew "cliclick"
brew "clipboard"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "curl"
brew "deno"
brew "diff-so-fancy"
brew "direnv"
brew "elixir"
brew "exercism"
brew "fd"
brew "figlet"
brew "findutils"
brew "fish"
brew "flyctl"
brew "fork-cleaner"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gdu"
brew "geos"
brew "gh"
brew "git-crypt"
brew "git-delta"
brew "gitui"
brew "glances"
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "gnupg"
brew "go"
brew "gpatch"
brew "harfbuzz"
brew "graphviz"
brew "grc"
brew "guile"
brew "helix"
brew "htop"
brew "hub"
brew "hyperfine"
brew "jq"
brew "lazygit"
brew "libass"
brew "libyaml"
brew "lolcat"
brew "lsd"
brew "lua"
brew "lua-language-server"
brew "luarocks"
brew "make"
brew "mas"
brew "node"
brew "mongosh"
brew "msgpack"
brew "mtr"
brew "nasm"
brew "ncdu"
brew "nghttp2"
brew "nmap"
brew "nnn"
brew "nowplaying-cli"
brew "openjdk"
brew "openjdk@11"
brew "osx-cpu-temp"
brew "perl"
brew "pinentry-mac"
brew "pngquant"
brew "pnpm"
brew "postgresql@14", restart_service: true
brew "prettier"
brew "prettyping"
brew "pstree"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ranger"
brew "rich-cli"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "rust-analyzer"
brew "rustup-init"
brew "sd"
brew "shellcheck"
brew "shfmt"
brew "showkey"
brew "spicetify-cli"
brew "stylua"
brew "switchaudio-osx"
brew "telnet"
brew "tldr"
brew "tmux"
brew "trash-cli"
brew "tree"
brew "tty-clock"
brew "vim"
brew "viu"
brew "watch"
brew "wget"
brew "wireguard-tools"
brew "xclip"
brew "xsel"
brew "yamllint"
brew "yarn"
brew "yt-dlp"
brew "zlib"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/krp"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "oven-sh/bun/bun"
brew "rigellute/tap/spotify-tui"
brew "stripe/stripe-cli/stripe"
cask "1password-cli"
cask "alacritty"
cask "apparency"
cask "arc"
cask "betterdisplay"
cask "brave-browser"
cask "discord"
cask "docker"
cask "font-cascadia-mono-pl"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "kitty"
cask "macs-fan-control"
cask "megasync"
cask "mongodb-compass"
cask "ngrok"
cask "nvidia-geforce-now"
cask "openinterminal"
cask "postman"
cask "qutebrowser"
cask "sf-symbols"
cask "sherlock"
cask "slack"
cask "spotify"
cask "steam"
cask "stolendata-mpv"
cask "suspicious-package"
cask "tableplus"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
mas "1Password for Safari", id: 1569813296
mas "Color Picker", id: 1545870783
mas "Peek", id: 1554235898
mas "SF Menu Bar", id: 1615595104
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "1password.op-vscode"
vscode "aaravb.chrome-extension-developer-tools"
vscode "achil.vscode-javascript-repl"
vscode "akamud.vscode-javascript-snippet-pack"
vscode "alexcvzz.vscode-sqlite"
vscode "antoniormrzz.electron-snippets"
vscode "asciidoctor.asciidoctor-vscode"
vscode "beauallison.brew-services"
vscode "benjaminbenais.copilot-theme"
vscode "bierner.lit-html"
vscode "bradlc.vscode-tailwindcss"
vscode "brandonjmatthews.one-dark-dark-plus"
vscode "burkeholland.simple-react-snippets"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.npm-intellisense"
vscode "coachrichbart.better-jest"
vscode "codezombiech.gitignore"
vscode "conradludgate.rust-playground"
vscode "ctcuff.font-preview"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "drcika.apc-extension"
vscode "dsznajder.es7-react-js-snippets"
vscode "duniul.dircolors"
vscode "dunstontc.vscode-go-syntax"
vscode "dunstontc.vscode-rust-syntax"
vscode "dustypomerleau.rust-syntax"
vscode "editorconfig.editorconfig"
vscode "emilast.logfilehighlighter"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "frhtylcn.pythonsnippets"
vscode "fsdevon.one-dark-plus"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "golang.go"
vscode "henriquebruno.github-repository-manager"
vscode "ibm.output-colorizer"
vscode "idleberg.applescript"
vscode "ivhernandez.vscode-plist"
vscode "jakebathman.mysql-syntax"
vscode "jeff-hykin.better-csv-syntax"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "jeff-hykin.better-go-syntax"
vscode "jeff-hykin.better-js-syntax"
vscode "jeff-hykin.better-perl-syntax"
vscode "jeff-hykin.better-shellscript-syntax"
vscode "jinliming2.vscode-go-template"
vscode "jock.svg"
vscode "jscearcy.rust-doc-viewer"
vscode "kshetline.ligatures-limited"
vscode "ldez.ignore-files"
vscode "leizongmin.node-module-intellisense"
vscode "mads-hartmann.bash-ide-vscode"
vscode "maximilionus.dark-shell"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "msyrus.go-doc"
vscode "naumovs.color-highlight"
vscode "otovo-oss.htmx-tags"
vscode "paulmolluzzo.convert-css-in-js"
vscode "qufiwefefwoyn.inline-sql-syntax"
vscode "rebornix.toggle"
vscode "remisa.shellman"
vscode "rogalmic.bash-debug"
vscode "rogalmic.zsh-debug"
vscode "rpinski.shebang-snippets"
vscode "rust-lang.rust-analyzer"
vscode "ryotamannari.babel-plugin-react-css-modules-autocomplete"
vscode "sensnerd.pributan"
vscode "serayuzgur.crates"
vscode "sharat.vscode-brewfile"
vscode "sidneys1.gitconfig"
vscode "skyran.js-jsx-snippets"
vscode "solomonkinard.chrome-extension-api"
vscode "solomonkinard.chrome-extensions"
vscode "sourcegraph.cody-ai"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "tetradresearch.vscode-h2o"
vscode "timonwong.shellcheck"
vscode "tobermory.es6-string-html"
vscode "tomoki1207.pdf"
vscode "truman.autocomplate-shell"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vintharas.learn-vim"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wakatime.vscode-wakatime"
vscode "wangweixuan.yithemes"
vscode "xadillax.viml"
vscode "yanzf.playgroundcode"
vscode "yoavbls.pretty-ts-errors"
vscode "zhuangtongfa.material-theme"
