tap "buo/cask-upgrade"               # Tool for upgrading all casks with one command
tap "chase/tap"                      # Personal tap for Chase's packages
tap "felixkratz/formulae"            # Felix Kratz's packages including sketchybar
tap "iina/mpv-iina"                  # Repository for IINA player dependencies
tap "koekeishiya/formulae"           # Repository for window management tools like yabai
tap "oven-sh/bun"                    # Repository for Bun JavaScript runtime
tap "rigellute/tap"                  # Repository containing Spotify TUI

brew "readline"                      # Library for command-line editing
brew "sqlite"                        # Self-contained SQL database engine
brew "awscli"                        # Official Amazon AWS command-line interface
brew "bash"                          # Bourne Again SHell, a UNIX command interpreter
brew "bat"                           # Cat clone with syntax highlighting and Git integration
brew "binutils"                      # GNU binary tools for native development
brew "btop"                          # Resource monitor that shows usage and stats
brew "glib"                          # Core application building blocks for libraries and applications
brew "cmake"                         # Cross-platform make system
brew "coreutils"                     # GNU File, Shell, and Text utilities
brew "curl"                          # Command line tool for transferring data with URL syntax
brew "exiftool"                      # Tool for reading, writing and editing meta information
brew "eza"                           # Modern replacement for 'ls' command
brew "fastfetch"                     # Fast system information tool
brew "fd"                            # Simple, fast and user-friendly alternative to find
brew "gnutls"                        # GNU Transport Layer Security (TLS) Library
brew "harfbuzz"                      # OpenType text shaping engine
brew "ffmpeg"                        # Play, record, convert, and stream audio and video
brew "findutils"                     # Collection of GNU find, xargs, and locate
brew "flyctl"                        # Command-line tools for fly.io services
brew "fzf"                           # Command-line fuzzy finder
brew "gawk"                          # GNU awk utility
brew "gcc"                           # GNU compiler collection
brew "gdu"                           # Disk usage analyzer with console interface
brew "gh"                            # GitHub command-line tool
brew "git"                           # Distributed revision control system
brew "git-lfs"                       # Git extension for versioning large files
brew "gitui"                         # Terminal UI for git
brew "gnu-sed"                       # GNU implementation of the sed utility
brew "gnu-tar"                       # GNU version of the tar archiving utility
brew "go"                            # Open source programming language
brew "grc"                           # Colorize logfiles and command output
brew "pkgconf"                       # Package compiler and linker metadata toolkit
brew "guile"                         # GNU Ubiquitous Intelligent Language for Extensions
brew "htop"                          # Improved top (interactive process viewer)
brew "libyaml"                       # YAML Parser
brew "huggingface-cli"               # CLI for Hugging Face services
brew "imagemagick"                   # Tools and libraries to manipulate images
brew "jq"                            # Lightweight and flexible command-line JSON processor
brew "keychain"                      # User-friendly front-end to ssh-agent
brew "lolcat"                        # Rainbows and unicorns for terminal output
brew "lsd"                           # The next gen ls command with colors and icons
brew "lua"                           # Powerful, lightweight programming language
brew "luarocks"                      # Package manager for Lua modules
brew "macchina"                      # System information fetcher with a focus on performance
brew "macpine"                       # Alpine Linux VMs for macOS
brew "make"                          # Utility for directing compilation
brew "mas"                           # Mac App Store command-line interface
brew "media-info"                    # Tool to display technical and tag data for audio/video
brew "mkcert"                        # Simple tool to make locally trusted development certificates
brew "mongosh"                       # MongoDB Shell
brew "moreutils"                     # Collection of tools that nobody wrote when UNIX was young
brew "mtr"                           # Improved traceroute/ping tool
brew "nasm"                          # Netwide Assembler (NASM) for x86 architecture
brew "nmap"                          # Port scanning utility for network exploration
brew "nowplaying-cli"                # Display current playing media from various players
brew "nvm"                           # Manage multiple Node.js versions
brew "ollama"                        # Local large language model runner
brew "openjdk"                       # Development kit for the Java programming language
brew "osx-cpu-temp"                  # Display CPU temperature in macOS terminal
brew "perl"                          # Perl programming language
brew "prettier"                      # Code formatter for JavaScript, CSS, JSON, etc.
brew "prettyping"                    # Wrapper around ping with colorful output
brew "pstree"                        # Show processes as a tree
brew "python@3.10"                   # Python programming language, version 3.10
brew "resvg"                         # SVG rendering library and CLI tool
brew "rich-cli"                      # Command-line tool for rich text formatting
brew "ripgrep"                       # Fast search tool like grep and The Silver Searcher
brew "ruby"                          # Dynamic, open source programming language
brew "rust"                          # Safe, concurrent, practical language
brew "sevenzip"                      # File archiver with a high compression ratio
brew "shellcheck"                    # Static analysis and lint tool for shell scripts
brew "shfmt"                         # Shell script formatter
brew "sshpass"                       # Non-interactive SSH password auth
brew "staticcheck"                   # State of the art linter for Go
brew "stylua"                        # Opinionated Lua code formatter
brew "switchaudio-osx"               # Change macOS audio source from command-line
brew "telnet"                        # User interface to the TELNET protocol
brew "tlrc"                          # Local reverse proxy manager
brew "tmux"                          # Terminal multiplexer
brew "transmission-cli"              # Lightweight BitTorrent client (CLI)
brew "tree"                          # Display directories as trees
brew "tty-clock"                     # Terminal clock
brew "typescript"                    # Language for application scale JavaScript development
brew "unar"                          # Command-line unarchiving tools
brew "vim"                           # Highly configurable text editor
brew "watch"                         # Executes a program periodically, showing output
brew "weechat"                       # Extensible IRC client
brew "wget"                          # Internet file retriever
brew "xclip"                         # Command-line interface to the X11 clipboard
brew "xsel"                          # Command-line program for getting and setting the X selection
brew "yamllint"                      # Linter for YAML files
brew "yazi"                          # Modern file manager
brew "yt-dlp"                        # Command-line program to download videos from YouTube
brew "zig"                           # Programming language designed for robustness and clarity
brew "chase/tap/awrit"               # Tool for writing AI generated text
brew "felixkratz/formulae/sketchybar" # Highly customizable macOS status bar
brew "koekeishiya/formulae/krp"      # Key repeat daemon for macOS
brew "koekeishiya/formulae/skhd"     # Simple hotkey daemon for macOS
brew "koekeishiya/formulae/yabai"    # Tiling window manager for macOS
brew "oven-sh/bun/bun"               # Fast JavaScript runtime, bundler, transpiler, and package manager
brew "rigellute/tap/spotify-tui"     # Spotify terminal user interface

cask "1password"                     # Password manager
cask "apparency"                     # Tool to inspect macOS app bundles
cask "betterdisplay"                 # Display management and resolution enhancer
cask "blender"                       # 3D creation suite
cask "brave-browser"                 # Privacy-focused web browser
cask "chatgpt"                       # Desktop app for ChatGPT
cask "comfyui"                       # GUI for Stable Diffusion
cask "diffusionbee"                  # Stable Diffusion GUI app for macOS
cask "discord"                       # Voice and text chat software
cask "docker"                        # App to build and share containerized applications
cask "firefox"                       # Web browser
cask "font-cascadia-code-pl"         # Font with programming ligatures, Powerline variant
cask "font-cascadia-mono-pl"         # Monospace font, Powerline variant
cask "font-caskaydia-cove-nerd-font" # Nerd Font patched Cascadia Code font
cask "font-caskaydia-mono-nerd-font" # Nerd Font patched Cascadia Mono font
cask "font-fira-code-nerd-font"      # Nerd Font patched Fira Code font
cask "font-fira-mono-nerd-font"      # Nerd Font patched Fira Mono font
cask "font-jetbrains-mono-nerd-font" # Nerd Font patched JetBrains Mono font
cask "font-sf-mono"                  # Apple's monospaced font used in Terminal
cask "font-symbols-only-nerd-font"   # Nerd Font with only symbols
cask "ghostty"                       # Fast GPU-accelerated terminal emulator
cask "gimp"                          # Free and open-source image editor
cask "google-chrome"                 # Web browser
cask "gpg-suite"                     # Tools for using GPG encryption
cask "iina"                          # Modern media player for macOS
cask "karabiner-elements"            # Keyboard customizer for macOS
cask "keka"                          # File archiver
cask "lm-studio"                     # GUI for running local LLMs
cask "macs-fan-control"              # Controls fans on Apple computers
cask "megasync"                      # File synchronization client for Mega
cask "miniforge"                     # Conda-based Python distribution
cask "nvidia-geforce-now"            # Cloud gaming service
cask "openinterminal"                # Finder extension to open terminal from finder
cask "postman"                       # API development environment
cask "qutebrowser"                   # Keyboard-focused browser with a minimal GUI
cask "spotify"                       # Music streaming service
cask "steam"                         # Gaming platform
cask "stolendata-mpv"                # Media player based on MPlayer and mplayer2
cask "suspicious-package"            # App for inspecting macOS installer packages
cask "tor-browser"                   # Browser for accessing the Tor network
cask "transmission"                  # BitTorrent client
cask "vlc"                           # Multimedia player
cask "vscodium"                      # Community-driven, freely-licensed binary distribution of VS Code
cask "zen"                           # Browser for distraction-free reading

vscode "1password.op-vscode"         # 1Password extension for VS Code
vscode "alexcvzz.vscode-sqlite"      # SQLite viewer for VS Code
vscode "asvetliakov.vscode-neovim"   # Neovim integration for VS Code
vscode "christian-kohler.npm-intellisense" # Autocomplete for npm modules in import statements
vscode "cloudedcat.vscode-model-viewer" # 3D model viewer for VS Code
vscode "continue.continue"           # AI coding assistant for VS Code
vscode "dbaeumer.vscode-eslint"      # ESLint integration for VS Code
vscode "donjayamanne.githistory"     # Git history viewer
vscode "donjayamanne.python-environment-manager" # Python environment manager
vscode "drcika.apc-extension"        # Auto-completion and function parameter display
vscode "edwinkofler.vscode-assorted-languages" # Support for various programming languages
vscode "emilast.logfilehighlighter"  # Adds syntax highlighting for log files
vscode "esbenp.prettier-vscode"      # Code formatter using Prettier
vscode "formulahendry.code-runner"   # Run code snippet or file
vscode "foxundermoon.shell-format"   # Shell script formatter
vscode "golang.go"                   # Go language support
vscode "hangxingliu.vscode-nginx-conf-hint" # NGINX configuration file support
vscode "jeanp413.open-remote-ssh"    # SSH remote development
vscode "jellydn.vscode-settings-cycler" # Cycle between different VS Code settings
vscode "jock.svg"                    # SVG viewer and editor
vscode "johnnymorganz.stylua"        # Lua code formatter
vscode "kleber-swf.unity-code-snippets" # Unity code snippets for VS Code
vscode "llvm-vs-code-extensions.vscode-clangd" # C/C++ completion, navigation and insights
vscode "mads-hartmann.bash-ide-vscode" # IDE-like features for Bash scripts
vscode "matt-rudge.auto-open-preview-panel" # Automatically opens preview panels
vscode "mattpocock.ts-error-translator" # TypeScript error translator
vscode "mhutchie.git-graph"          # Git graph visualization
vscode "mikestead.dotenv"            # .env file support
vscode "ms-azuretools.vscode-docker" # Docker integration
vscode "ms-dotnettools.vscode-dotnet-runtime" # .NET runtime for VS Code extensions
vscode "ms-python.autopep8"          # Python formatter
vscode "ms-python.debugpy"           # Python debugger
vscode "ms-python.python"            # Python language support
vscode "ms-toolsai.jupyter"          # Jupyter notebook support
vscode "ms-toolsai.jupyter-keymap"   # Jupyter keymaps
vscode "ms-toolsai.jupyter-renderers" # Jupyter notebook renderers
vscode "ms-toolsai.vscode-jupyter-cell-tags" # Jupyter cell tags support
vscode "ms-toolsai.vscode-jupyter-slideshow" # Jupyter slideshow support
vscode "ms-vscode.wasm-wasi-core"    # WebAssembly System Interface (WASI) support
vscode "muhammad-sammy.csharp"       # C# language support
vscode "naumovs.color-highlight"     # Highlights colors in code
vscode "neonxp.gotools"              # Go tools and utilities
vscode "nromanov.dotrush"            # .NET utilities
vscode "ocamllabs.ocaml-platform"    # OCaml language support
vscode "openai.chatgpt"              # ChatGPT integration
vscode "qwtel.sqlite-viewer"         # SQLite viewer
vscode "redhat.vscode-xml"           # XML language support
vscode "redhat.vscode-yaml"          # YAML language support
vscode "ritwickdey.liveserver"       # Local development server with live reload
vscode "rust-lang.rust-analyzer"     # Rust language support
vscode "shan.code-settings-sync"     # Synchronize VS Code settings across machines
vscode "slevesque.shader"            # Shader language support
vscode "sumneko.lua"                 # Lua language support
vscode "tamasfe.even-better-toml"    # TOML language support
vscode "timonwong.shellcheck"        # Shell script linter
vscode "tobiah.unity-tools"          # Tools for Unity development
vscode "tomoki1207.pdf"              # PDF viewer
vscode "usernamehw.errorlens"        # Inline error display
vscode "vadimcn.vscode-lldb"         # LLDB debugger
vscode "vue.volar"                   # Vue language support
vscode "wakatime.vscode-wakatime"    # Metrics, insights, and time tracking for programming
vscode "xabikos.javascriptsnippets"  # JavaScript code snippets
vscode "xadillax.viml"               # Vim script language support
vscode "zhuangtongfa.material-theme" # Material theme for VS Code
vscode "ziglang.vscode-zig"          # Zig language support