akamud.vscode-theme-onedark
angelorafael.jsx-html-tags
bengreenier.vscode-node-readme
bierner.markdown-emoji
BitBelt.converttoasciiart
Bruce.rona
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
cipchk.cssrem
cssho.vscode-svgviewer
ctcuff.font-preview
ctf0.macros
dbaeumer.vscode-eslint
diegolincoln.vscode-styled-components
donjayamanne.python-environment-manager
donjayamanne.typescript-notebook
DotJoshJohnson.xml
eg2.vscode-npm-script
esbenp.prettier-vscode
Fooxly.workspace
GitHub.copilot
GitHub.remotehub
golang.go
GraphQL.vscode-graphql
IBM.output-colorizer
iocave.customize-ui
iocave.monkey-patch
ionutvmi.path-autocomplete
lehni.vscode-fix-checksums
lightyen.tailwindcss-intellisense-twin
mhutchie.git-graph
miguelsolorio.fluent-icons
mikestead.dotenv
mongodb.mongodb-vscode
ms-azuretools.vscode-docker
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-renderers
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cpptools
orasik.graphql-to-rest-queries
patricklee.vsnotes
PWABuilder.pwa-studio
rafamel.subtle-brackets
rebornix.toggle
samundrak.esdoc-mdn
silvenon.mdx
SirTori.indenticator
slevesque.shader
spmeesseman.vscode-taskexplorer
steoates.autoimport
tanhakabir.rest-book
techer.open-in-browser
Thinker.create-app
Tobermory.es6-string-html
VisualStudioExptTeam.vscodeintellicode
vivaxy.vscode-conventional-commits
WakaTime.vscode-wakatime
wangweixuan.yithemes
xabikos.JavaScriptSnippets
yechunan.json-color-token
Zignd.html-css-class-completion