cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-versions'
tap 'heroku/brew'

brew 'ack'
brew 'asdf'
brew 'autoenv'
brew 'awscli'
brew 'bat'
brew 'coreutils'
brew 'deno'
brew 'fd'
brew 'fnm'
brew 'fzf'
brew 'gh'
brew 'go'
brew 'heroku'
brew 'jq'
brew 'mongocli'
brew 'node'
brew 'openssl'
brew 'pyenv'
brew 'rbenv'
brew 'ruby-build'
brew 'readline'
brew 'ranger'
brew 'shellcheck'
brew 'spark'
brew 'starship'
brew 'speedtest-cli'
brew 'tag'
brew 'wget'
brew 'yarn'
brew 'yt-dlp/taps/yt-dlp'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

cask 'adium'
cask 'alfred'
cask 'apparency'
cask 'appcleaner'
cask 'authy'
cask 'battle-net'
cask 'blackhole-2ch'
cask 'blackhole-16ch'
cask 'bitwarden'
cask 'brave-browser'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'handbrake'
cask 'insomnia'
cask 'iterm2'
cask 'mongodb-compass'
cask 'nvidia-geforce-now'
cask 'obs'
cask 'postman'
cask 'rar'
cask 'sketch'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'steam'
cask 'streamlabs-obs'
cask 'suspicious-package'
cask 'swiftbar'
cask 'the-unarchiver'
cask 'tor-browser'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
